Autodesk.Revit.DB.Units.GetModifiableSpecs
Gets all specs for which the default FormatOptions can be modified.
Returns:
Identifiers of the specs for which the FormatOptions can be modified.
Since:
2014

Autodesk.Revit.DB.Units.IsModifiableSpec(Autodesk.Revit.DB.ForgeTypeId)
Checks whether the default FormatOptions can be modified for a given spec.
Remarks:
The Units class stores a FormatOptions object for every spec, but
not all of them can be directly modified. Some have fixed
definitions.
specTypeId:
Identifier of the spec to check.
Returns:
True if the FormatOptions can be modified, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.Units.SetFormatOptions(Autodesk.Revit.DB.ForgeTypeId,Autodesk.Revit.DB.FormatOptions)
Sets the default FormatOptions for a spec.
specTypeId:
Identifier of the spec.
options:
The FormatOptions.
Throws Autodesk.Revit.Exceptions.ArgumentException:
specTypeId is not a measurable spec identifier. See UnitUtils.IsMeasurableSpec(ForgeTypeId).
-or-
FormatOptions cannot be modified for specTypeId. See Units.IsModifiableSpec(ForgeTypeId) and Units.GetModifiableSpecs().
-or-
UseDefault is true in options.
-or-
The unit in options is not valid for specTypeId. See UnitUtils.IsValidUnit(ForgeTypeId, ForgeTypeId) and UnitUtils.GetValidUnits(ForgeTypeId).
-or-
The rounding method in options is not set to Nearest.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.Units.GetFormatOptions(Autodesk.Revit.DB.ForgeTypeId)
Gets the default FormatOptions for a spec.
specTypeId:
Identifier of the spec.
Returns:
A copy of the FormatOptions.
Throws Autodesk.Revit.Exceptions.ArgumentException:
specTypeId is not a measurable spec identifier. See UnitUtils.IsMeasurableSpec(ForgeTypeId).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014